SiliconLabs/simplicity_sdk/platform/Device/SiliconLabs/MGM27/Include/mgm27_gpio.h
/* Bit fields for GPIO EXTIFALL */
#define _GPIO_EXTIFALL_RESETVALUE                     0x00000000UL                           /**< Default value for GPIO_EXTIFALL             */
#define _GPIO_EXTIFALL_MASK                           0x00000FFFUL                           /**< Mask for GPIO_EXTIFALL                      */
#define _GPIO_EXTIFALL_EXTIFALL_SHIFT                 0                                      /**< Shift value for GPIO_EXTIFALL               */
#define _GPIO_EXTIFALL_EXTIFALL_MASK                  0xFFFUL                                /**< Bit mask for GPIO_EXTIFALL                  */
#define _GPIO_EXTIFALL_EXTIFALL_DEFAULT               0x00000000UL                           /**< Mode DEFAULT for GPIO_EXTIFALL              */
#define GPIO_EXTIFALL_EXTIFALL_DEFAULT                (_GPIO_EXTIFALL_EXTIFALL_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_EXTIFALL      */

/* Bit fields for GPIO IF */
#define _GPIO_IF_RESETVALUE                           0x00000000UL                      /**< Default value for GPIO_IF                   */
#define _GPIO_IF_MASK                                 0x0FFF0FFFUL                      /**< Mask for GPIO_IF                            */
#define GPIO_IF_EXTIF0                                (0x1UL << 0)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF0_SHIFT                         0                                 /**< Shift value for GPIO_EXTIF0                 */
#define _GPIO_IF_EXTIF0_MASK                          0x1UL                             /**< Bit mask for GPIO_EXTIF0                    */
#define _GPIO_IF_EXTIF0_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF0_DEFAULT                        (_GPIO_IF_EXTIF0_DEFAULT << 0)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF1                                (0x1UL << 1)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF1_SHIFT                         1                                 /**< Shift value for GPIO_EXTIF1                 */
#define _GPIO_IF_EXTIF1_MASK                          0x2UL                             /**< Bit mask for GPIO_EXTIF1                    */
#define _GPIO_IF_EXTIF1_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF1_DEFAULT                        (_GPIO_IF_EXTIF1_DEFAULT << 1)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF2                                (0x1UL << 2)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF2_SHIFT                         2                                 /**< Shift value for GPIO_EXTIF2                 */
#define _GPIO_IF_EXTIF2_MASK                          0x4UL                             /**< Bit mask for GPIO_EXTIF2                    */
#define _GPIO_IF_EXTIF2_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF2_DEFAULT                        (_GPIO_IF_EXTIF2_DEFAULT << 2)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF3                                (0x1UL << 3)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF3_SHIFT                         3                                 /**< Shift value for GPIO_EXTIF3                 */
#define _GPIO_IF_EXTIF3_MASK                          0x8UL                             /**< Bit mask for GPIO_EXTIF3                    */
#define _GPIO_IF_EXTIF3_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF3_DEFAULT                        (_GPIO_IF_EXTIF3_DEFAULT << 3)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF4                                (0x1UL << 4)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF4_SHIFT                         4                                 /**< Shift value for GPIO_EXTIF4                 */
#define _GPIO_IF_EXTIF4_MASK                          0x10UL                            /**< Bit mask for GPIO_EXTIF4                    */
#define _GPIO_IF_EXTIF4_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF4_DEFAULT                        (_GPIO_IF_EXTIF4_DEFAULT << 4)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF5                                (0x1UL << 5)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF5_SHIFT                         5                                 /**< Shift value for GPIO_EXTIF5                 */
#define _GPIO_IF_EXTIF5_MASK                          0x20UL                            /**< Bit mask for GPIO_EXTIF5                    */
#define _GPIO_IF_EXTIF5_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF5_DEFAULT                        (_GPIO_IF_EXTIF5_DEFAULT << 5)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF6                                (0x1UL << 6)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF6_SHIFT                         6                                 /**< Shift value for GPIO_EXTIF6                 */
#define _GPIO_IF_EXTIF6_MASK                          0x40UL                            /**< Bit mask for GPIO_EXTIF6                    */
#define _GPIO_IF_EXTIF6_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF6_DEFAULT                        (_GPIO_IF_EXTIF6_DEFAULT << 6)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF7                                (0x1UL << 7)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF7_SHIFT                         7                                 /**< Shift value for GPIO_EXTIF7                 */
#define _GPIO_IF_EXTIF7_MASK                          0x80UL                            /**< Bit mask for GPIO_EXTIF7                    */
#define _GPIO_IF_EXTIF7_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF7_DEFAULT                        (_GPIO_IF_EXTIF7_DEFAULT << 7)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF8                                (0x1UL << 8)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF8_SHIFT                         8                                 /**< Shift value for GPIO_EXTIF8                 */
#define _GPIO_IF_EXTIF8_MASK                          0x100UL                           /**< Bit mask for GPIO_EXTIF8                    */
#define _GPIO_IF_EXTIF8_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF8_DEFAULT                        (_GPIO_IF_EXTIF8_DEFAULT << 8)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF9                                (0x1UL << 9)                      /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF9_SHIFT                         9                                 /**< Shift value for GPIO_EXTIF9                 */
#define _GPIO_IF_EXTIF9_MASK                          0x200UL                           /**< Bit mask for GPIO_EXTIF9                    */
#define _GPIO_IF_EXTIF9_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF9_DEFAULT                        (_GPIO_IF_EXTIF9_DEFAULT << 9)    /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF10                               (0x1UL << 10)                     /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF10_SHIFT                        10                                /**< Shift value for GPIO_EXTIF10                */
#define _GPIO_IF_EXTIF10_MASK                         0x400UL                           /**< Bit mask for GPIO_EXTIF10                   */
#define _GPIO_IF_EXTIF10_DEFAULT                      0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF10_DEFAULT                       (_GPIO_IF_EXTIF10_DEFAULT << 10)  /**< Shifted mode DEFAULT for GPIO_IF            */
#define GPIO_IF_EXTIF11                               (0x1UL << 11)                     /**< External Pin Flag                           */
#define _GPIO_IF_EXTIF11_SHIFT                        11                                /**< Shift value for GPIO_EXTIF11                */
#define _GPIO_IF_EXTIF11_MASK                         0x800UL                           /**< Bit mask for GPIO_EXTIF11                   */
#define _GPIO_IF_EXTIF11_DEFAULT                      0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EXTIF11_DEFAULT                       (_GPIO_IF_EXTIF11_DEFAULT << 11)  /**< Shifted mode DEFAULT for GPIO_IF            */
#define _GPIO_IF_EM4WU_SHIFT                          16                                /**< Shift value for GPIO_EM4WU                  */
#define _GPIO_IF_EM4WU_MASK                           0xFFF0000UL                       /**< Bit mask for GPIO_EM4WU                     */
#define _GPIO_IF_EM4WU_DEFAULT                        0x00000000UL                      /**< Mode DEFAULT for GPIO_IF                    */
#define GPIO_IF_EM4WU_DEFAULT                         (_GPIO_IF_EM4WU_DEFAULT << 16)    /**< Shifted mode DEFAULT for GPIO_IF            */

